const compile = require('..');

describe('compile', () => {
  it('test', () => {
    const raw = getTest();
    const ret = compile(raw, Object.assign({}, compile.baseOptions, {
      type: 'component',
      filePath: process.cwd(),
    }));
    expect(ret).toEqual();
  });
});

function getTest() {
  return `import { createElemnt } from 'rax';

export default function() {
  let result;
  
  if (type === 'pointExchange') {
    result = (
      <view>
        <view>
          权益介绍：会员通过交易、互动等累积的店铺积分，可在积分有效期内参与商家提供的积分兑换活动，可兑换权益包括但不限于店铺优惠券、店铺赠品、支付宝红包、淘票票优惠券、优酷会员卡等，其中积分兑换的店铺赠品需最少以0.01元下单购买，且需在2小时内完成下单，逾期则失效
        </view>
        <view>
          权益说明：会员可享受的积分兑换活动具体以商家实际设置提供为准，可通过店铺会员中心中查看积分兑换的活动明细，如有疑问可咨询商家客服
        </view>
      </view>
    );
  }
  if (type === 'memberBenefit') {
    result = (
      <view>
        <view>
          权益介绍：符合领取条件的会员，可在活动规定时间内领取的会员专属礼券
        </view>
        <view>【会员专享券】：符合领取条件的会员，可领取至少1张店铺优惠券</view>
        <view>
          【会员专享礼】：符合领取条件的会员，可领取1个店铺赠品，该商品需以0.01元下单购买，且领取后需在2小时内完成下单，过期则自动失效
        </view>
        <view>
          【会员礼包】：符合领取条件的会员，可有机会领取1个优惠礼包，该礼包最多包含3张优惠券及1个店铺赠品，最少包含1张优惠券或1个店铺赠品，其中赠品需以0.01元下单购买，且赠品领取后需在2小时内完成下单，逾期则自动失效
          权益说明：会员具体可领取的专享礼券，需以商家实际设置提供为准，可通过会员中心专享礼券查询并领取相应权益，未在活动规定时间内领取则自动失效，如有疑问可咨询商家客服
        </view>
      </view>
    );
  }
  if (type === 'return') {
    result = (
      <view>
        <view>{content && content.ruleDesc}</view>
        <view>
          权益介绍：对于本店参与“七天无理由”的商品，符合条件的会员发起的“七天无理由”原因的退货退款，权益期限从7天扩展到15天，即签收后15天内都可以发起七天无理由原因退款申请
        </view>
      </view>
    );
  }
  if (type === 'refund') {
    result = (
      <view>
        <view>
          权益介绍：符合条件的会员发起退货退款，且商家同意退货申请后，可享受缩短退款进账等待时间
        </view>
        <view>
          权益说明：退款总金额需低于500元，且会员连续30天内最多可享受一次优先退服务权益，如会员当前信誉评级情况不满足使用条件，则无法正常享受该特权，如有疑问可咨询商家客服
        </view>
      </view>
    );
  }
  if (type === 'newMemberGift') {
    result = (
      <view>
        <view>
          权益介绍：符合入会门槛的消费者首次授权注册入会后，可在活动规定时间内领取的新会员入会专属礼券
        </view>
        <view>
          【新会员礼包】符合领取条件的新会员，在入会成功24小时内即有机会领取1个入会礼包，该礼包最多包含3张优惠券及1个店铺赠品，最少包含1张优惠券或1个店铺赠品，其中赠品需以0.01元下单购买，且赠品领取后需在2小时内完成下单，逾期则自动失效
          权益说明：消费者具体可领取的新会员入会专享礼，需以商家实际设置提供为准，且仅限符合条件的新会员领取1次，未在入会24小时内及活动规定时间内领取则自动失效，新会员可通过会员中心入会有礼入口领取该权益，不满足领取条件的新会员则不展示，如有疑问可咨询商家客服
        </view>
        <view>
          领取说明：新会员专享券及新会员专享礼仅限会员领取1次1份，满足条件的新会员需在活动时间内完成领取
        </view>
      </view>
    );
  }
  if (type === 'getPoint') {
    result = (
      <view>
        <view>
          权益介绍：会员在店铺成功交易并确认收货完成后方可获取店铺积分，积分获取额度将以会员购买的实际支付金额进行计算，获取的积分可应用于商家提供的积分享兑活动。
        </view>
        <view>{content && content.ruleDesc}</view>
        <view>
          权益说明：购物积分及其获取规则以商家实际设置提供为准，会员可通过店铺会员中心我的积分入口，查询到可用积分总额及积分变动明细，如有疑问可咨询商家客服
        </view>
      </view>
    );
  }
  if (type === 'memberDiscount') {
    result = (
      <view>
        <view>
          权益介绍：会员购买商品满足活动门槛后，可享受的买赠、折扣等活动。
        </view>
        <view>{content && content.ruleDesc}</view>
        <view>权益介绍：</view>
        <view>【会员满送赠品】满足活动门槛后，会员可享受专属的高价值赠品</view>
        <view>
          【会员多件多折】购买商品件数满足活动门槛后，会员可享受更优的商品折扣
          权益说明：会员具体可享受的专享优惠，需以商家实际设置提供为准，未在活动规定时间内或未满足活动门槛要求则不可享受，如有疑问可咨询商家客服
        </view>
      </view>
    );
  }
  return (<block>{result}</block>);
}

`
}
